InformationRegisters/Б24_СМ_ТаблицаИзменений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>Б24_СМ_ТаблицаИзменений</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВремяЗаписиВМиллисекундах</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>НастройкаПодключения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Б24_К_НастройкиПодключения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипВладельцаСмартПроцесса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>4</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдСмартПроцесса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>5</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипСущности1С</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сущность1С</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>80</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторОбъекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

CommonModules/Б24_СМ_РегистрацияИзмененийСервер/Ext/Module.bsl
#Область РегистрацияИзменений

Процедура ПодпискаНаСобытиеПриИзмененииПриЗаписи(Источник, Отказ) Экспорт
	
	
	Если Источник.ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли; 
	
	Если Источник.ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;
	
	//мТипыДляРегистрации = Новый Массив(2);
	//мТипыДляРегистрации[0] = Тип("СправочникОбъект.Помещения");
	//мТипыДляРегистрации[1] = Тип("СправочникОбъект.ИзделияЗаказчика");
	
	мТипыДляРегистрации = Новый Массив(1);
	//мТипыДляРегистрации[0] = Тип("СправочникОбъект.Помещения");
	//мТипыДляРегистрации[1] = Тип("СправочникОбъект.ИзделияЗаказчика");
	
	
	Если мТипыДляРегистрации.Найти(ТипЗнч(Источник)) = Неопределено Тогда        
	
		Возврат;	
	
	КонецЕсли;
	ЗарегистрироватьИзменения(Источник, Ложь, Отказ);
	
КонецПроцедуры

Процедура ЗарегистрироватьИзменения(Источник, Замещение, Отказ) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если омВыгрузкаCRMНаСевереПовтор.ЗапретВыгрузкиВБитрикс() Тогда
		Возврат;
	КонецЕсли;
	
	Если Источник.ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
#Область ДобавлениеИнформацииДляИсключенияРегистрации
	ЗагрузкаСБитрикс24 = Неопределено;
	Источник.ДополнительныеСвойства.Свойство("ЗагрузкаСБитрикс24", ЗагрузкаСБитрикс24);
	
	Если ЗагрузкаСБитрикс24 = Истина ИЛИ ПараметрыСеанса.ВыполняетсяОбновлениеИБ Тогда
		Возврат;
	КонецЕсли;
#КонецОбласти	
	
	ТипОбъекта 	= ТипЗнч(Источник);
	
	МассивВыгружаемыхВРежимеРеальногоВремени = Б24_СМ_ОбщегоНазначенияВызовСервераПовтИсп.ПолучитьМассивНастроекОВыгружаемыхДанных(Истина);
	Для каждого ИнформацияОНастройкеСинхронизации Из МассивВыгружаемыхВРежимеРеальногоВремени Цикл
		
		НастройкаПодключения = ИнформацияОНастройкеСинхронизации.НастройкаПодключения;
		
		//Если НЕ Б24_К_СлужебныйВызовСервера.МодульСмартПроцессовДоступен(НастройкаПодключения) Тогда
		//	Возврат;
		//КонецЕсли;                          
		
		Для каждого ТекИнформацияОВыгружаемыхДанных Из ИнформацияОНастройкеСинхронизации.ИнформацияОВыгружаемыхДанных Цикл
			
			Если ТипОбъекта =  Тип("РегистрСведенийНаборЗаписей.ДополнительныеСведения") Тогда
				ПроверитьДобавитьИзмененныйОбъектДопСведением(Замещение, Источник, НастройкаПодключения, ТекИнформацияОВыгружаемыхДанных)	
			Иначе
				ЗарегистрироватьОбъект(НастройкаПодключения, ТекИнформацияОВыгружаемыхДанных, Источник.Ссылка);	
			КонецЕсли;
			
		КонецЦикла;   
		
		Если ИнформацияОНастройкеСинхронизации.СпособСинхронизацииДанных = "ВРежимеРеальногоВремени"  Тогда   
			
			ИменаИспользуемыхРеглЗаданий	= Б24_К_ОбщегоНазначенияВызовСервера.ПолучитьИменаИспользуемыхРеглЗаданий();
			НаименованиеФоновогоЗадания 	= ИменаИспользуемыхРеглЗаданий.ВыгрузкаВРежимеРВСМ;
			Если Б24_К_ОбщегоНазначенияВызовСервера.СейчасВыполняетсяЗадание(НаименованиеФоновогоЗадания) Тогда
				Возврат;			
			КонецЕсли;

			УникальныйИдентификатор 						= Новый УникальныйИдентификатор;
			ПараметрыВыполнения 							= ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
			ПараметрыВыполнения.НаименованиеФоновогоЗадания = НаименованиеФоновогоЗадания;
			ПараметрыВыполнения.ОжидатьЗавершение 			= 0;
			
			ПараметрыВыгрузки = Новый Структура;     
			ПараметрыВыгрузки.Вставить("УстановитьТаймаут"			, 5);
			ПараметрыВыгрузки.Вставить("НастройкаПодключения"		, НастройкаПодключения);
			ПараметрыВыгрузки.Вставить("СпособСинхронизацииДанных"	, ИнформацияОНастройкеСинхронизации.СпособСинхронизацииДанных);
			ДлительныеОперации.ВыполнитьВФоне("Б24_СМ_РегистрацияИзмененийСервер.ЗапускВыгрузкиВРеальномВремениВФоне", ПараметрыВыгрузки, ПараметрыВыполнения);
			
		КонецЕсли; 
		
	КонецЦикла;
	
	УстановитьПривилегированныйРежим(Ложь);

КонецПроцедуры

Процедура ПроверитьДобавитьИзмененныйОбъектДопСведением(Замещение, Источник, НастройкаПодключения, ИнформацияОВыгружаемыхДанных)
	
	УжеДобавлены = Новый Массив;
	
	Если Замещение Тогда
		
		СтарыйНаборЗаписей = РегистрыСведений.ДополнительныеСведения.СоздатьНаборЗаписей();
		
		Для Каждого ЗначениеОтбора Из Источник.Отбор Цикл
			
			Если ЗначениеОтбора.Использование = Ложь Тогда
				Продолжить;
			КонецЕсли;
			
			СтрокаОтбора = СтарыйНаборЗаписей.Отбор.Найти(ЗначениеОтбора.Имя);
			СтрокаОтбора.Значение = ЗначениеОтбора.Значение;
			СтрокаОтбора.Использование = Истина;
			
		КонецЦикла;
		
		СтарыйНаборЗаписей.Прочитать();
		
		Для каждого Запись Из СтарыйНаборЗаписей Цикл
			
			Если УжеДобавлены.Найти(Запись.Объект) = Неопределено Тогда
				УжеДобавлены.Добавить(Запись.Объект);
				ЗарегистрироватьОбъект(НастройкаПодключения, ИнформацияОВыгружаемыхДанных, Запись.Объект);	
			КонецЕсли;
					
		КонецЦикла;
		
	КонецЕсли;
	
	Для Каждого Запись Из Источник Цикл     
		
		Если ЗначениеЗаполнено(Запись.Объект) Тогда 
			
			Если УжеДобавлены.Найти(Запись.Объект) = Неопределено Тогда
				УжеДобавлены.Добавить(Запись.Объект);
				ЗарегистрироватьОбъект(НастройкаПодключения, ИнформацияОВыгружаемыхДанных, Запись.Объект);	
			Иначе;
				Продолжить;
			КонецЕсли;
			
		КонецЕсли; 
		
	КонецЦикла; 
	
КонецПроцедуры


Процедура ЗарегистрироватьОбъект(НастройкаПодключения, ИнформацияОВыгружаемыхДанных, Объект)
	
	Если ЗначениеЗаполнено(Объект) Тогда 
		
		ТипОбъекта 	= ТипЗнч(Объект);
		
		НужноРегистрировать = Ложь;
		
		Если ИнформацияОВыгружаемыхДанных.ТипСущности1С = "Справочник" Тогда
			
			Если ТипОбъекта = Тип("СправочникСсылка."  + ИнформацияОВыгружаемыхДанных.Сущность1С) Тогда
				НужноРегистрировать = Истина;	
			КонецЕсли;
			
		ИначеЕсли ИнформацияОВыгружаемыхДанных.ТипСущности1С = "Документ" Тогда
			
			Если ТипОбъекта = Тип("ДокументСсылка."+ИнформацияОВыгружаемыхДанных.Сущность1С)	Тогда
				НужноРегистрировать = Истина;	
			КонецЕсли;
			
		КонецЕсли;
		
		Если НужноРегистрировать Тогда

			СтруктураОтбора = Новый Структура;
			СтруктураОтбора.Вставить("НастройкаПодключения"		, НастройкаПодключения);
			СтруктураОтбора.Вставить("ТипВладельцаСмартПроцесса", ИнформацияОВыгружаемыхДанных.ТипВладельцаСмартПроцесса);
			СтруктураОтбора.Вставить("ИдСмартПроцесса"			, ИнформацияОВыгружаемыхДанных.ИдСмартПроцесса);
			СтруктураОтбора.Вставить("ТипСущности1С"			, ИнформацияОВыгружаемыхДанных.ТипСущности1С);
			СтруктураОтбора.Вставить("Сущность1С"				, ИнформацияОВыгружаемыхДанных.Сущность1С);
			СтруктураОтбора.Вставить("ИдентификаторОбъекта"		, XMLСтрока(Объект));
			
			Если РегистрыСведений.Б24_СМ_ТаблицаИзменений.Получить(СтруктураОтбора).ВремяЗаписиВМиллисекундах = 0 Тогда 
					
				НоваяЗапись = РегистрыСведений.Б24_СМ_ТаблицаИзменений.СоздатьМенеджерЗаписи();
				ЗаполнитьЗначенияСвойств(НоваяЗапись, СтруктураОтбора);
				НоваяЗапись.ВремяЗаписиВМиллисекундах	= ТекущаяУниверсальнаяДатаВМиллисекундах();
				НоваяЗапись.Записать();
					
			КонецЕсли;

		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗапускВыгрузкиВРеальномВремениВФоне(ПараметрыВыгрузки, АдресРезультата) Экспорт
	
	ИнформационнаяБазаФайловая = Б24_К_ОбщегоНазначенияВызовСервераПовтИсп.ИнформационнаяБазаФайловая();

	Если ПараметрыВыгрузки.Свойство("УстановитьТаймаут") И НЕ ИнформационнаяБазаФайловая Тогда
		Б24_К_ОбщегоНазначенияВызовСервера.Таймаут(ПараметрыВыгрузки.УстановитьТаймаут);    // для того, чтобы транзакции завершились.
	КонецЕсли;  
	
	Б24_СМ_ОбщегоНазначенияВызовСервера.ВыгрузкаВРеальномВремени(ПараметрыВыгрузки.НастройкаПодключения, ПараметрыВыгрузки.СпособСинхронизацииДанных);	

КонецПроцедуры

#КонецОбласти
